In [5]:
import pandas as pd
import numpy as np

In [7]:
data = {
    'total_spend': [10000, 60000, 20000, np.nan, 5000, 40000],
    'active_days': [10, 30, 15, 25, np.nan, 20],
    'churn': [0, 1, 0, 1, 0, 0]
}

df = pd.DataFrame(data)
df

   total_spend  active_days  churn
0      10000.0         10.0      0
1      60000.0         30.0      1
2      20000.0         15.0      0
3          NaN         25.0      1
4       5000.0          NaN      0
5      40000.0         20.0      0

In [8]:
df["avg_spend_per_day"] = df["total_spend"] / df["active_days"]
df["is_high_value_costomer"] = (df["total_spend"] > 50000).astype(int)

In [9]:
df

   total_spend  active_days  churn  avg_spend_per_day  is_high_value_costomer
0      10000.0         10.0      0        1000.000000                       0
1      60000.0         30.0      1        2000.000000                       1
2      20000.0         15.0      0        1333.333333                       0
3          NaN         25.0      1                NaN                       0
4       5000.0          NaN      0                NaN                       0
5      40000.0         20.0      0        2000.000000                       0